--Часть 5. Задача 1. Клиенты, которые сделали заказ с максимальной суммой
SELECT
	first_name,	-- Имя клиента
	last_name,	-- Фамилия клиента
	amount	-- Стоимость ьовара
FROM customers c	-- Таблица-источник с псевдонимом 'c' 
INNER JOIN orders o	-- Внутреннее соединение  таблицей заказов (псевдоним 'o'); 
		-- соединяем только те записи, где есть соответствие клиента и его заказа
ON c.customer_id = o.customer_id	-- Условие связи по ID клиента
	-- Фильтр: выбираем только заказы с максимальной стоимостью 
WHERE o.amount = (	
		-- Подзапрос для вычисления максимальной суммы заказов во всей таблице 
	SELECT MAX(amount)
	FROM orders 
)