--Часть 2. Задача 1. Список заказов с именами клиентов, которые сделали заказ
SELECT	-- Ключевое слово для выборки данных
	first_name,	-- Имя клиента
	last_name,	-- Фамилия клиента
	item,	-- Название товара
	amount	-- Цена товара
FROM customers	-- Таблица-источник (покупатели)
INNER JOIN orders	-- Таблица, с которой происходит объединение (заказы); способо объединения - только по совпадениям в обеих таблицах
ON customers.customer_id = orders.customer_id;	-- Определение поля, по которому происходит связывание