# Задача 1. Список покупок
# Описание: Выводим список покупок в консоль
shopping_list = ["milk", "bread", "eggs", "butter", "apples"] # Создаём список
number = 1 # Переменная для нумерации
print("Список покупок:") # Указываем пользователю, что будет выведено далее
for item in shopping_list: # Создаём цикл, который будет проходить по списку и
    print(f"{number}. {item}") # выводить в консоль его содержимое
    number += 1 # Увеличиваем нумерацию на один в конце каждой итерации
