# Задача 2. Обратный отсчет до запуска
# Описание: Программа запрашивает у пользователя число и имитирует обратный отсчёт до запуска ракеты
countdown = int(input("Введите число для обратного отсчёта: ")) # Переменная для хранения числа, от которого начинается отсчёт
while countdown > 0: # Цикл, который выполняется до тех пор, пока переменная отсчёта не станет равной 0
    print(f"{countdown}...") # Выводим числа обратного отсчёта
    countdown -= 1 # Уменьшаем переменную на один в каждой итерации
print("Go!") # Пуск ракеты
