# Задача 3. Угадай число
# Описание: Программа загадывает число от 1 до 10. Пользователь вводит числа до тех пор, пока не угадает.
import random
secret_number = random.randint(1,10) # Генерация случайного число от 1 до 10
while True: # Цикл, который будет продолжаться до того момента, пока пользователь не угадает.
    estimated_number = int(input("Угадайте число от 1 до 10: ")) # Запрашиваем у пользователя число и преобразуем строку в целое число
    if estimated_number != secret_number: # Проверяем, совпадает ли число с загаданным
        print("Неверно, попробуйте ещё раз.")
    else: # Число угадано - завершаем цикл
        print("Поздравляю! Вы угадали число!")
        break