# Задача 4. Обработка данных
# Описание: Подсчёт баллов с особыми правилами:
# ● Если балл отрицательный (< 0), его нужно проигнорировать и перейти к
# # следующему.
# # ● Если встречается балл 0, это сигнал, что список данных обрывается, и нужно
# # немедленно прекратить подсчет.
# # ● Если цикл прошел через все баллы и не был прерван (т.е. не встретил 0), нужно
# # вывести сообщение, что все данные были обработаны корректно.
scores = [75, 88, -10, 95, 100, -25, 89]  # Список с баллами
total_score = 0  # Переменная для общего количества баллов
for score in scores:  # Цикл для прохода по списку
    if score < 0:  # Если элемент списка меньше нуля, переходим к следующей итерации
        continue
    if score == 0:  # Если элемент равен нулю, завершаем цикл
        print("Обработка прервана.")
        break
    else: # Суммируем все баллы в переменной total_score
        print("Добавлен балл: ", score)
        total_score += score
else: # Срабатывает только если не был прерван цикл
    print("Все данные обработаны")
print(f"\nИтоговая сумма баллов: {total_score}")