# Задание 5. Рисуем Прямоугольник
# Описание: Программа запрашивает у пользователя высоту и ширину прямоугольника, а затем рисует его из символов "*"
high = int(input("Введите высоту прямоугольника: "))
width = int(input("Введите ширину прямоугольника: "))
for i in range(high): # Внешний цикл для высоты прямоугольника
    for j in range(width): # Внутренний цикл для ширины
        print("*", end="")
    print() # Переход на следующую строку