# Упражнения 5
# Дан список чисел nums и целевое число target. Найти индексы двух чисел, сумма которых равна target
nums = [2, 7, 11, 15]
target = 9
n = len(nums) # Переменная для хранения длины списка
nums_indices = [] # Переменная для индексов искомых чисел
for i in range(n): # Внешний цикл отвечает за первое число из пары, проходит по всему списку
    for j in range(i + 1, n): # Внутренний цикл выбирает второе число, условие прохода позволяет избежать суммирования одинаковых чисел
        if nums[i] + nums[j] == target: # Условие для выборки чисел
            nums_indices = [i, j] # Заполняем ранее созданный список индексами найденных чисел
            print(f"Исходный список: {nums}. Целевое число: {target}")
            print(f"Индексы требуемых чисел: {nums_indices}") # Выводим список
if nums_indices == []: # Если не было найдено подходящей пар чисел, выводим соответствующее сообщение
    print("Числа не найдены.")

